doc/load-test.yml
config:
  target: "https://z5o65f7ygibugzkimjslwquobi0jpkpm.lambda-url.eu-west-3.on.aws"  # ✔️ URL valide
  phases:
    - duration: 60     # ✔ 60 secondes
      arrivalRate: 50  # ✔ 50 requêtes par seconde

scenarios:
  - flow:
      - get:
          url: "/stored-int"  # ✔ endpoint ciblé